app/views/admin/show.html.erb

<th>&nbsp;&nbsp;isAdmin&nbsp;&nbsp;</th>
    <% User.find_each do |user| %>
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1000

        <% numberOfPost = 0 %>
        <% Post.find_each do |post| %>
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1000

        <% numberOfComment = 0 %>
        <% Feedback.find_each do |feedback| %>
---
SELECT  "feedbacks".* FROM "feedbacks"  ORDER BY "feedbacks"."id" ASC LIMIT 1000