app/views/shared/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
<p><%= feedback.comment %></p>
<p>-Wrote by <%= User.find(feedback.sender_id).name %> <%= time_ago_in_words(feedback.created_at) %> ago.
    <% if current_user.id == feedback.recipient_id || current_user.id == feedback.sender_id%>