app/views/posts/_post.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (courseName LIKE '%%' OR courseCode LIKE '%%' OR department LIKE '%%')  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
    <h2>
      <%= link_to image_tag(User.find(post.user_id).image.url(:medium), :size => '55x50'), :controller => "posts", :action => :show, :post => post.id%>