app/views/posts/new.html.erb

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
    <div class="col-xs-6">
      <% if current_user.posts.any? %>