app/views/posts/show.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 3]]
---
<% if params[:post] %>
    <% @post = Post.find(params[:post]) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
---
<h2><%= @post.description %></h2>
<h2>contact me: <%= User.find(@post.user_id).email %></h2>