app/controllers/conversations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def new
        @receiptient = User.where(id: params[:receiptientID])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
    def create
        recipients = User.where(id: conversation_params[:recipients])