app/controllers/feedbacks_controller.rb

    def create
        @feedback = Feedback.new(post_params)
        if @feedback.save
---
INSERT INTO "feedbacks" ("comment", "rating", "sender_id", "recipient_id", "postId", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comment", "great!"], ["rating", 4.0], ["sender_id", 2], ["recipient_id", 2], ["postId", 5], ["created_at", "2016-11-30 00:26:19.502594"], ["updated_at", "2016-11-30 00:26:19.502594"]]