app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.build(post_params)
        if @post.save
---
INSERT INTO "posts" ("courseName", "courseCode", "price", "department", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 3]]

    def update
        @post = Post.find(params[:id])
        if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 5]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "ggttt"], ["updated_at", "2016-11-30 00:56:02.600915"], ["id", 10]]

    def destroy
        Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 10]]