app/controllers/users_controller.rb

    def update
        @user = current_user
        @user.image = params[:image]
        if @user.save
---
UPDATE "users" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_file_name", nil], ["image_content_type", nil], ["image_file_size", nil], ["image_updated_at", nil], ["updated_at", "2016-12-05 06:27:38.978486"], ["id", 1]]

    def create
        @user = User.new(user_params)
        puts 'user params:', user_params
        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def show
        @user = current_user
        @posts = @user.posts.paginate(page: params[:page])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

     def set_as_admin
        @user = User.find(params[:id])
        @user.isAdmin = true
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "users" SET "isAdmin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["isAdmin", "t"], ["updated_at", "2016-11-30 00:53:24.294272"], ["id", 3]]

    def delete_user
        @user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]