app/controllers/welcome_controller.rb

    def search
        if params[:search]
            @posts = Post.search(params[:search])
---
SELECT "posts".* FROM "posts" WHERE (courseName LIKE '%java%' OR courseCode LIKE '%java%' OR department LIKE '%java%')  ORDER BY "posts"."created_at" DESC